# language: ru
Функциональность: отображение элементов управления калькулятора
  Как пользователь калькулятора
  Я хочу видеть элементы управления для выполнения арифметических операций

  Сценарий: На странице есть элементы ввода
    Допустим я открыл страницу калькулятора
    То я вижу поле "Первое число"
    И я вижу поле "Второе число"
    И я вижу селект операций
    И я вижу селект системы счисления для первого числа
    И я вижу селект системы счисления для второго числа
    И я вижу поле для настройки точности результата
    И я вижу кнопку "Вычислить"
